# Proyecto 03 - Sistemas de Recomendación

## Dataset: STEAM

**Recuerda descargar el dataset de [aquí](https://github.com/kang205/SASRec). Son dos archivos, uno de calificaciones y otro de información sobre los juegos.**

En este notebook te dejamos unas celdas para que puedas comenzar a trabajar con este dataset. Sin embargo, **deberás** modificarlas para hacer un mejor manejo de datos. Algunas cosas a las que deberás prestar atención (tal vez no a todas):
1. Tipos de datos: elige tipos de datos apropiados para cada columna.
2. Descartar columnas poco informativas.
3. Guardar en memoria datasets preprocesados para no tener que repetir código que tarde en correr.

### Exploración de datos

Dedícale un buen tiempo a hacer un Análisis Exploratorio de Datos. Elige preguntas que creas que puedas responder con este dataset. Por ejemplo, ¿cuáles son los juegos más populares?¿Y los menos populares?

### Filtro Colaborativo

Deberás implementar un sistema de recomendación colaborativo para este dataset. Ten en cuenta:

1. Haz todas las transformaciones de datos que consideres necesarias. Justifica.
1. Evalúa de forma apropiada sus resultados. Justifica la métrica elegida.
1. Elige un modelo benchmark y compara tus resultados con este modelo.
1. Optimiza los hiperparámetros de tu modelo.

Puedes implementar un filtro colaborativo a partir de la similitud coseno o índice de Jaccard. ¿Puedes utilizar los métodos de la librería Surprise? Si no es así, busca implementaciones (por ejemplo, nuevas librerías) que sean apropiadas.

Para comenzar a trabajar, puedes asumir que cada entrada es un enlace entre una persona usuaria y un item, **independientemente** de si la crítica es buena o mala. 

### Para pensar, investigar y, opcionalmente, implementar
1. ¿Cómo harías para ponerle un valor a la calificación?
1. ¿Cómo harías para agregar contenido? Por ejemplo, cuentas con el género, precio, fecha de lanzamiento y más información de los juegos.
1. ¿Hay algo que te gustaría investigar o probar?

### **¡Tómate tiempo para investigar y leer mucho!**

In [1]:
#import gzip
#import pandas as pd

#def parse(path):
#    g = gzip.open(path, 'r')
#    for l in g:
#        yield eval(l)

**Reviews**

In [2]:
#contador = 0
#data_reviews = []
# Vamos a guardar una de cada 10 reviews para no llenar la memoria RAM. Si pones n = 3, 
# abrira uno de cada tres, y asi.
#n = 10
#for l in parse('steam_reviews.json.gz'):
#    if contador%n == 0:
#        data_reviews.append(l)
#    else:
#        pass
#    contador += 1

In [3]:
#data_reviews = pd.DataFrame(data_reviews)

In [4]:
#data_reviews.head()

In [5]:
#data_reviews.to_csv('new_data_reviews.csv')

**Games**

In [6]:
#data_games = []
#for l in parse('steam_games.json.gz'):
#    data_games.append(l)
#data_games = pd.DataFrame(data_games)

In [7]:
#data_games.head()

In [8]:
#data_games.to_csv('new_data_games.csv')

### 1. ANÁLISIS EXPLORATORIO DE DATOS

#### 1.1 ANÁLISIS INICIAL

__Qué es Steam?__  
Steam es un sistema de distribución de juegos multiplataforma en línea, con alrededor de 75 millones de usuarios activos, alrededor de 172 millones de cuentas en total, que aloja más de 3000 juegos, lo que lo convierte en una plataforma ideal para el tipo de trabajo que aquí se presenta. El conjunto de datos contiene registros de más de 3000 juegos y aplicaciones.  

Steam es un servicio de distribución digital de videojuegos de Valve. Se lanzó como un cliente de software independiente en septiembre de 2003 como una forma de que Valve proporcionara actualizaciones automáticas para sus juegos y se expandió para incluir juegos de editores externos. Steam también se ha expandido a una tienda digital móvil y basada en la web en línea.  

De acuerdo con la popularidad del juego, la similitud de la descripción del juego, la calidad del juego y la preferencia del jugador por el juego, recomiendan el juego correspondiente al jugador del juego, de modo que Steam obtenga un mayor grado de satisfacción del cliente.

1. __Se importan las librerías__ necesarias para trabajar en la consigna.

In [9]:
import numpy as np
import matplotlib.pyplot as plt
import seaborn as sns
sns.set()

import pandas as pd

import gc # garbage collector

from surprise import Dataset # convertimos nuestro Dataframe en Dataset
                             # es la estructura de datos que utiliza Surprise!, para almacenar la Matriz de Utilidad
                             # es la forma de almacenar datos con menos memoria, ya que la Matriz de Utilidad es muy grande     
from surprise import Reader # lector de Surprise!
from surprise.model_selection import train_test_split
# quita calificacione de usuario-película de forma aleatoria s/ toda la matriz de utilidad, teniendo cuidado de no quitarle..
# ..todas las calificaciones a un usuario ni a una película

2. __Se realiza la carga el dataset__ usando las funcionalidades de Pandas.

__DATA REVIEW__

In [10]:
new_data_review = pd.read_csv('new_data_reviews.csv')

In [11]:
new_data_review.shape # Filas y columnas

(779307, 13)

* *El Dataset, cuenta con **779.307 Filas**, y **13 Columnas**.*

In [12]:
new_data_review.head(3) # Primeras 3 instancias (filas)

,Unnamed: 0,username,hours,products,product_id,page_order,date,text,early_access,page,user_id,compensation,found_funny
0,0,Chaos Syren,0.1,41.0,725280,0,2017-12-17,This would not be acceptable as an entertainme...,False,1,NaN,NaN,NaN
1,1,Ariman1,13.2,1386.0,328100,2,2017-08-02,Addictive RPG ! Works fine on linux though it ...,False,1,NaN,NaN,NaN
2,2,freakfantom,0.1,1706.0,725280,5,2017-11-12,Прикольная стрелялка. Взял дешево на распродаже.,False,1,NaN,NaN,NaN

__DATA GAMES__

In [13]:
new_data_games = pd.read_csv('new_data_games.csv')

In [14]:
new_data_games.shape # Filas y columnas

(32135, 17)

* *El Dataset, cuenta con **32.135 Filas**, y **13 Columnas**.*

In [15]:
new_data_games.head(3) # Primeras 3 instancias (filas)

,Unnamed: 0,publisher,genres,app_name,title,url,release_date,tags,discount_price,reviews_url,specs,price,early_access,id,developer,sentiment,metascore
0,0,Kotoshiro,"['Action', 'Casual', 'Indie', 'Simulation', 'S...",Lost Summoner Kitty,Lost Summoner Kitty,http://store.steampowered.com/app/761140/Lost_...,2018-01-04,"['Strategy', 'Action', 'Indie', 'Casual', 'Sim...",4.49,http://steamcommunity.com/app/761140/reviews/?...,['Single-player'],4.99,False,761140.0,Kotoshiro,NaN,NaN
1,1,"Making Fun, Inc.","['Free to Play', 'Indie', 'RPG', 'Strategy']",Ironbound,Ironbound,http://store.steampowered.com/app/643980/Ironb...,2018-01-04,"['Free to Play', 'Strategy', 'Indie', 'RPG', '...",NaN,http://steamcommunity.com/app/643980/reviews/?...,"['Single-player', 'Multi-player', 'Online Mult...",Free To Play,False,643980.0,Secret Level SRL,Mostly Positive,NaN
2,2,Poolians.com,"['Casual', 'Free to Play', 'Indie', 'Simulatio...",Real Pool 3D - Poolians,Real Pool 3D - Poolians,http://store.steampowered.com/app/670290/Real_...,2017-07-24,"['Free to Play', 'Simulation', 'Sports', 'Casu...",NaN,http://steamcommunity.com/app/670290/reviews/?...,"['Single-player', 'Multi-player', 'Online Mult...",Free to Play,False,670290.0,Poolians.com,Mostly Positive,NaN

3. __Valores Faltantes:__ se imprimen en pantalla los nombres de las columnas y cuántos valores faltantes hay por columna. En un principio es a mera exposición, ya que por el momento no vamos a descartar ninguno de ellos,ni realizar imputación de datos.

__DATA REVIEW__

In [16]:
new_data_review.isnull().sum() # Nombres de las columnas y su cantidad de faltantes

Unnamed: 0           0
username            18
hours             2637
products          1566
product_id           0
page_order           0
date                 0
text              1839
early_access         0
page                 0
user_id         461967
compensation    764719
found_funny     659143
dtype: int64

* *Variables con elementos faltantes:*  
    *1. `compensation` **98%** (764.719);*  
    *2. `found_funny` **86%** (659.143);*  
    *3. `user_id` 59% c/u (461.967);*  
    *4. `hours` 0,3% (2.637);*  
    *5. `text` 0,2% (1.839);*  
    *6. `product` 0,2% (1.566).*

__DATA GAMES__

In [17]:
new_data_games.isnull().sum() # Nombres de las columnas y su cantidad de faltantes

Unnamed: 0            0
publisher          8062
genres             3283
app_name              2
title              2050
url                   0
release_date       2067
tags                163
discount_price    31910
reviews_url           2
specs               670
price              1377
early_access          0
id                    2
developer          3299
sentiment          7182
metascore         29528
dtype: int64

* *Casi todos las Variables tienen elementos faltantes. Detallamos las principales:*  
    *1. `discount_price` **98%** (31.910);*  
    *2. `metascore` **98%** (29.528);*  
    *3. `publisher` 59% c/u (8.062);*  
    *4. `sentiment` 0,3% (7.182);*  
    *5. `developer` 0,2% (3.299);*  
    *6. `genres` 0,2% (3.283).*
    
* *Cabe aclarar que el `id` de los juegos, tienen 2 valores faltantes.*
* *`metascore` refiere a la media de todas las reseñas recibidas para dicho juego.*

#### 1.2 FILTRO COLABORATIVO

* __Recomendación Colaborativa:__ se buscan Usuarios similares a mi, y de acuerdo a ello, se usan los productos que ellos consumen para recomendarmelos a mí (que yo no he usado, consumido, escuchado, etc.). Se utiliza lo que se sabe de mí y en función de ello se buscan usuarios que se parecen a mí.
    * Ventajas: no necesito tener info acerca de los productos.
    * Desventajas: necesitamos tener la matríz de utilidad (que es muy dispersa) y llenarla es costosa en tiempo y dinero.
    
* Necesitamos un dataset donde cada fila represente un `usuario`, un `juego` y la `calificación del usuario` a ese juego. Es decir, tiras de tres componentes. Hay otra información que puede ser útil, pero con esos tres datos ya podemos implementar un filtro colaborativo.

CASO PARTICULAR STEAM
* No hay registros tanto en el sitio web Steam, sobre las calificaciones continuas de estos usuarios. En realidad, en la plataforma, los usuarios sólo dan "Recomendación" o "No Recomendación", lo que significa revisiones binarias, positivas y negativas, incluso en el sitio web del usuario, todavía no hay ningún mecanismo sobre las calificaciones continuas como una estrella a cinco estrellas.
* Para obtener calificaciones continuas sobre la interacción entre los usuarios y los juegos, debemos suponer un mecanismo de interacción de calificación de los juegos por parte de los usuarios. Ya que las concentraciones de los usuarios sobre los juegos pueden ser ajustadas por sus `tiempos de juego`, podemos asumir que el tiempo de juego es una información bastante persuasiva sobre los intereses de los usuarios.
* Por lo tanto, aquí asumimos que la mediana del tiempo de juego es una parte muy importante de los intereses.

1. Seleccionamos aquellos **features que nos seran útiles** a la hora de aplicar un **filtro colaborativo**.

DATA REVIEWS

In [18]:
df = pd.read_csv('new_data_reviews.csv', dtype={'hours': np.float, 'product_id': np.int})
print(df.shape)
df.head()

(779307, 13)

,Unnamed: 0,username,hours,products,product_id,page_order,date,text,early_access,page,user_id,compensation,found_funny
0,0,Chaos Syren,0.1,41.0,725280,0,2017-12-17,This would not be acceptable as an entertainme...,False,1,NaN,NaN,NaN
1,1,Ariman1,13.2,1386.0,328100,2,2017-08-02,Addictive RPG ! Works fine on linux though it ...,False,1,NaN,NaN,NaN
2,2,freakfantom,0.1,1706.0,725280,5,2017-11-12,Прикольная стрелялка. Взял дешево на распродаже.,False,1,NaN,NaN,NaN
3,3,The_Cpt_FROGGY,7.8,2217.0,631920,0,2017-12-11,Somewhere on Zibylon:\n~~~~~~~~~~~~~~~~~~\nZib...,False,1,7.656120e+16,Product received for free,NaN
4,4,the_maker988,8.2,18.0,35140,7,2018-01-02,"This game was way to linear for me, and compar...",False,1,7.656120e+16,NaN,NaN

In [19]:
df1 = df[['username','hours','product_id']]
df1

                username    hours  product_id
0            Chaos Syren      0.1      725280
1                Ariman1     13.2      328100
2            freakfantom      0.1      725280
3         The_Cpt_FROGGY      7.8      631920
4           the_maker988      8.2       35140
...                  ...      ...         ...
779302            Vidaar    783.5      252490
779303  Nikolai Belinski     55.1      252490
779304      RancorZealot    203.5      252490
779305             Jerry    139.8      252490
779306              Helk  15375.0      252490

[779307 rows x 3 columns]

In [20]:
df1.isnull().sum()

username        18
hours         2637
product_id       0
dtype: int64

In [21]:
df2 = df1.dropna()

In [22]:
df2.isnull().sum()

username      0
hours         0
product_id    0
dtype: int64

In [23]:
df2

                username    hours  product_id
0            Chaos Syren      0.1      725280
1                Ariman1     13.2      328100
2            freakfantom      0.1      725280
3         The_Cpt_FROGGY      7.8      631920
4           the_maker988      8.2       35140
...                  ...      ...         ...
779302            Vidaar    783.5      252490
779303  Nikolai Belinski     55.1      252490
779304      RancorZealot    203.5      252490
779305             Jerry    139.8      252490
779306              Helk  15375.0      252490

[776652 rows x 3 columns]

In [24]:
from sklearn.preprocessing import LabelEncoder

le = LabelEncoder()
df2['username'] = le.fit_transform(df2['username'])
print(df1['username'])

0              Chaos Syren
1                  Ariman1
2              freakfantom
3           The_Cpt_FROGGY
4             the_maker988
                ...
779302              Vidaar
779303    Nikolai Belinski
779304        RancorZealot
779305               Jerry
779306                Helk
Name: username, Length: 779307, dtype: object

<ipython-input-24-90da9d7c35ee>:4: SettingWithCopyWarning:
A value is trying to be set on a copy of a slice from a DataFrame.
Try using .loc[row_indexer,col_indexer] = value instead

See the caveats in the documentation: https://pandas.pydata.org/pandas-docs/stable/user_guide/indexing.html#returning-a-view-versus-a-copy
  df2['username'] = le.fit_transform(df2['username'])

In [25]:
df2.describe()

            username          hours     product_id
count  776652.000000  776652.000000  776652.000000
mean   262784.000720     111.832608  251383.988125
std    153705.078889     390.027612  149982.073364
min         0.000000       0.000000      10.000000
25%    130321.750000       4.000000  203770.000000
50%    260266.000000      15.300000  252490.000000
75%    391053.250000      59.600000  346110.000000
max    539031.000000   28164.000000  773900.000000

In [26]:
bins = [0, 5632.8, 11265.6, 16898.4, 22531.2, 28164]
labels =[1,2,3,4,5]

df2['ranking'] = pd.cut(df2['hours'], bins,labels=labels)

print (df2)

        username    hours  product_id ranking
0          62380      0.1      725280       1
1          26824     13.2      328100       1
2         433539      0.1      725280       1
3         347057      7.8      631920       1
4         502630      8.2       35140       1
...          ...      ...         ...     ...
779302    365958    783.5      252490       1
779303    241609     55.1      252490       1
779304    275569    203.5      252490       1
779305    168334    139.8      252490       1
779306    147127  15375.0      252490       3

[776652 rows x 4 columns]

<ipython-input-26-9ee8095e43d3>:4: SettingWithCopyWarning:
A value is trying to be set on a copy of a slice from a DataFrame.
Try using .loc[row_indexer,col_indexer] = value instead

See the caveats in the documentation: https://pandas.pydata.org/pandas-docs/stable/user_guide/indexing.html#returning-a-view-versus-a-copy
  df2['ranking'] = pd.cut(df2['hours'], bins,labels=labels)

In [27]:
df2 = df2[['username','ranking','product_id']]
df2

        username ranking  product_id
0          62380       1      725280
1          26824       1      328100
2         433539       1      725280
3         347057       1      631920
4         502630       1       35140
...          ...     ...         ...
779302    365958       1      252490
779303    241609       1      252490
779304    275569       1      252490
779305    168334       1      252490
779306    147127       3      252490

[776652 rows x 3 columns]

In [28]:
df2.dtypes

username         int32
ranking       category
product_id       int32
dtype: object

In [29]:
df2['ranking']=df2['ranking'].astype("category")
df2['ranking']=df2['ranking'].cat.codes
df2.username.dtype

<ipython-input-29-72a0d60b2e4f>:1: SettingWithCopyWarning:
A value is trying to be set on a copy of a slice from a DataFrame.
Try using .loc[row_indexer,col_indexer] = value instead

See the caveats in the documentation: https://pandas.pydata.org/pandas-docs/stable/user_guide/indexing.html#returning-a-view-versus-a-copy
  df2['ranking']=df2['ranking'].astype("category")
<ipython-input-29-72a0d60b2e4f>:2: SettingWithCopyWarning:
A value is trying to be set on a copy of a slice from a DataFrame.
Try using .loc[row_indexer,col_indexer] = value instead

See the caveats in the documentation: https://pandas.pydata.org/pandas-docs/stable/user_guide/indexing.html#returning-a-view-versus-a-copy
  df2['ranking']=df2['ranking'].cat.codes

dtype('int32')

In [30]:
from sklearn.preprocessing import OrdinalEncoder

oe = OrdinalEncoder()
df2['ranking'] = oe.fit_transform(df2[['ranking']])
print(df2['ranking'])

0         1.0
1         1.0
2         1.0
3         1.0
4         1.0
         ...
779302    1.0
779303    1.0
779304    1.0
779305    1.0
779306    3.0
Name: ranking, Length: 776652, dtype: float64

<ipython-input-30-59ed3e76782c>:4: SettingWithCopyWarning:
A value is trying to be set on a copy of a slice from a DataFrame.
Try using .loc[row_indexer,col_indexer] = value instead

See the caveats in the documentation: https://pandas.pydata.org/pandas-docs/stable/user_guide/indexing.html#returning-a-view-versus-a-copy
  df2['ranking'] = oe.fit_transform(df2[['ranking']])

In [31]:
df2['ranking'] = df2['ranking'].astype(int)

<ipython-input-31-b029b5107c58>:1: SettingWithCopyWarning:
A value is trying to be set on a copy of a slice from a DataFrame.
Try using .loc[row_indexer,col_indexer] = value instead

See the caveats in the documentation: https://pandas.pydata.org/pandas-docs/stable/user_guide/indexing.html#returning-a-view-versus-a-copy
  df2['ranking'] = df2['ranking'].astype(int)

In [32]:
df2.dtypes

username      int32
ranking       int32
product_id    int32
dtype: object

In [33]:
df2

        username  ranking  product_id
0          62380        1      725280
1          26824        1      328100
2         433539        1      725280
3         347057        1      631920
4         502630        1       35140
...          ...      ...         ...
779302    365958        1      252490
779303    241609        1      252490
779304    275569        1      252490
779305    168334        1      252490
779306    147127        3      252490

[776652 rows x 3 columns]

In [35]:
if True:
    df2.to_csv('final_review.csv', index= False)

DETERMINACIÓN DE RANKING
* Suponemos que si el tiempo de juego de un usuario para 'X' juego, es mayor a 22531.2, la calificación del usuario para 'X' juego es **5**.
* Si el tiempo de juego del usuario se encuentra entre 16898.4 y 22531.2 horas, la calificación se asume como **4**.
* Si el tiempo de juego del usuario se encuentra entre 11265.6 y 16898.4 horas, la calificación se asume como **3**.
* Si el tiempo de juego del usuario se encuentra entre 5632.8 y 11265.6 horas, la calificación se asume como **2**.
* Si el tiempo de juego del usuario se encuentra entre 1 y 5632.8 horas, la calificación se asume como **1**.

In [40]:
df_titulo = pd.read_csv('new_data_games.csv', encoding = "ISO-8859-1", usecols = [4,13])
df_titulo.head()

                     title        id
0      Lost Summoner Kitty  761140.0
1                Ironbound  643980.0
2  Real Pool 3D - Poolians  670290.0
3            å¼¹ç¸äºº2222  767400.0
4                      NaN  773570.0

In [41]:
df_titulo = df_titulo[['id','title']]
df_titulo.head()

         id                    title
0  761140.0      Lost Summoner Kitty
1  643980.0                Ironbound
2  670290.0  Real Pool 3D - Poolians
3  767400.0            å¼¹ç¸äºº2222
4  773570.0                      NaN

In [42]:
df_new = df_titulo.rename(columns={'id':'product_id'})
df_new

       product_id                     title
0        761140.0       Lost Summoner Kitty
1        643980.0                 Ironbound
2        670290.0   Real Pool 3D - Poolians
3        767400.0             å¼¹ç¸äºº2222
4        773570.0                       NaN
...           ...                       ...
32130    773640.0            Colony On Mars
32131    733530.0  LOGistICAL: South Africa
32132    610660.0             Russian Roads
32133    658870.0       EXIT 2 - Directions
32134    681550.0                       NaN

[32135 rows x 2 columns]

In [43]:
df_title = df_new[df_new['product_id'].notna()]

In [44]:
df_title.isnull().sum()

product_id       0
title         2049
dtype: int64

In [45]:
print(df_title['product_id'])

0        761140.0
1        643980.0
2        670290.0
3        767400.0
4        773570.0
           ...
32130    773640.0
32131    733530.0
32132    610660.0
32133    658870.0
32134    681550.0
Name: product_id, Length: 32133, dtype: float64

In [46]:
df_title[('product_id')] = df_title['product_id'].astype(int)

<ipython-input-46-9206b7264802>:1: SettingWithCopyWarning:
A value is trying to be set on a copy of a slice from a DataFrame.
Try using .loc[row_indexer,col_indexer] = value instead

See the caveats in the documentation: https://pandas.pydata.org/pandas-docs/stable/user_guide/indexing.html#returning-a-view-versus-a-copy
  df_title[('product_id')] = df_title['product_id'].astype(int)

In [47]:
print(df_title['product_id'])

0        761140
1        643980
2        670290
3        767400
4        773570
          ...
32130    773640
32131    733530
32132    610660
32133    658870
32134    681550
Name: product_id, Length: 32133, dtype: int32

In [48]:
df_title

       product_id                     title
0          761140       Lost Summoner Kitty
1          643980                 Ironbound
2          670290   Real Pool 3D - Poolians
3          767400             å¼¹ç¸äºº2222
4          773570                       NaN
...           ...                       ...
32130      773640            Colony On Mars
32131      733530  LOGistICAL: South Africa
32132      610660             Russian Roads
32133      658870       EXIT 2 - Directions
32134      681550                       NaN

[32133 rows x 2 columns]

In [49]:
df_title = df_title.set_index('product_id', drop=True)

In [50]:
df_title

                               title
product_id
761140           Lost Summoner Kitty
643980                     Ironbound
670290       Real Pool 3D - Poolians
767400                 å¼¹ç¸äºº2222
773570                           NaN
...                              ...
773640                Colony On Mars
733530      LOGistICAL: South Africa
610660                 Russian Roads
658870           EXIT 2 - Directions
681550                           NaN

[32133 rows x 1 columns]

In [51]:
df_title.dtypes

title    object
dtype: object